<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="pixel_values" type="Parameter" version="opset1">
			<data shape="?,?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="pixel_values">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_28" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="0" size="3072" />
			<output>
				<port id="0" precision="FP32" names="41,cls_token">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="__module.vit.embeddings/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_7344" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3072" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.vit.embeddings/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="3072" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="__module.vit.embeddings/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="43">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.vit.embeddings/prim::ListConstruct/Reshape_0" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3076" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.vit.embeddings/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3076" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.vit.embeddings/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32" names="54">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.vit.embeddings/aten::expand/Broadcast" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="3080" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.vit.embeddings/aten::expand/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.vit.embeddings/aten::expand/Broadcast_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="3092" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.vit.embeddings/aten::expand/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.vit.embeddings/aten::expand/Broadcast_2" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="55,cls_tokens">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_37" type="Const" version="opset1">
			<data element_type="f32" shape="768, 3, 16, 16" offset="3104" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="46,weight.53">
					<dim>768</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.vit.embeddings.patch_embeddings.projection/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="16, 16" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.vit.embeddings.patch_embeddings.projection/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768, 1, 1" offset="2362400" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.vit.embeddings.patch_embeddings.projection/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="51">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.vit.embeddings.patch_embeddings/aten::flatten/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.vit.embeddings.patch_embeddings/aten::flatten/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3072" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.vit.embeddings.patch_embeddings/aten::flatten/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2365472" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.vit.embeddings.patch_embeddings/aten::flatten/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2365476" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.vit.embeddings.patch_embeddings/aten::flatten/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.vit.embeddings.patch_embeddings/aten::flatten/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3076" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.vit.embeddings.patch_embeddings/aten::flatten/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.vit.embeddings.patch_embeddings/aten::flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="52">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.vit.embeddings.patch_embeddings/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="2365480" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.vit.embeddings.patch_embeddings/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="53,embeddings.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.vit.embeddings/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="57,embeddings.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.vit.embeddings/aten::add/Multiply" type="Const" version="opset1">
			<data element_type="f32" shape="1, 197, 768" offset="2365492" size="605184" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.vit.embeddings/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="58,input.1">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.vit.encoder.layer.0.layernorm_before/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3076" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.vit.encoder.layer.0.layernorm_before/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_8338" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="2970676" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.vit.encoder.layer.0.layernorm_before/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_8339" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="2973748" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.vit.encoder.layer.0.layernorm_before/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="92,input.5">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_201" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="2976820" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="99,weight.57">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.vit.encoder.layer.0.attention.attention.query/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_8340" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="5336116" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.vit.encoder.layer.0.attention.attention.query/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="100,x.9">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.vit.encoder.layer.0.attention.attention/prim::ListConstruct/Concat" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339188" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.vit.encoder.layer.0.attention.attention/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="122,x.11">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_277" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339204" size="16" />
			<output>
				<port id="0" precision="I32" names="123">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.vit.encoder.layer.0.attention.attention/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="124,query_layer.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_207" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="5339220" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="102,weight.59">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.vit.encoder.layer.0.attention.attention.key/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_8341" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="7698516" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.vit.encoder.layer.0.attention.attention.key/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="103,x.1">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.vit.encoder.layer.0.attention.attention/prim::ListConstruct/Concat_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339188" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.vit.encoder.layer.0.attention.attention/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="107,x.3">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_229" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339204" size="16" />
			<output>
				<port id="0" precision="I32" names="108">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.vit.encoder.layer.0.attention.attention/aten::permute/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="109,key_layer.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.vit.encoder.layer.0.attention.attention/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="126,attention_scores.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_8342" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="7701588" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.vit.encoder.layer.0.attention.attention/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="127,input.7">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.vit.encoder.layer.0.attention.attention/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="128,input.9">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_234" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="7701592" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="111,weight.61">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.vit.encoder.layer.0.attention.attention.value/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_8343" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="10060888" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.vit.encoder.layer.0.attention.attention.value/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="112,x.5">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.vit.encoder.layer.0.attention.attention/prim::ListConstruct/Concat_2" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339188" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.vit.encoder.layer.0.attention.attention/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="116,x.7">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_256" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339204" size="16" />
			<output>
				<port id="0" precision="I32" names="117">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.vit.encoder.layer.0.attention.attention/aten::permute/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="118,value_layer.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.vit.encoder.layer.0.attention.attention/aten::matmul/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="130,context_layer.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_315" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339204" size="16" />
			<output>
				<port id="0" precision="I32" names="131">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.vit.encoder.layer.0.attention.attention/aten::permute/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="132">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.vit.encoder.layer.0.attention.attention/prim::ListConstruct/Concat_3" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="10063960" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.vit.encoder.layer.0.attention.attention/aten::view/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="137,input.11">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_335" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="10063972" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="141,weight.63">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.vit.encoder.layer.0.attention.output.dense/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_8344" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="12423268" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.vit.encoder.layer.0.attention.output.dense/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="142,input.13">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.vit.encoder.layer.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="144,input.15">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.vit.encoder.layer.0.layernorm_after/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3076" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.vit.encoder.layer.0.layernorm_after/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_8345" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="12426340" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.vit.encoder.layer.0.layernorm_after/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_8346" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="12429412" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.vit.encoder.layer.0.layernorm_after/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="148,input.17">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_358" type="Const" version="opset1">
			<data element_type="f32" shape="3072, 768" offset="12432484" size="9437184" />
			<output>
				<port id="0" precision="FP32" names="152,weight.67">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.vit.encoder.layer.0.intermediate.dense/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_8347" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 3072" offset="21869668" size="12288" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.vit.encoder.layer.0.intermediate.dense/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="153,input.19">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.vit.encoder.layer.0.intermediate.intermediate_act_fn/aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="154,input.21">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_367" type="Const" version="opset1">
			<data element_type="f32" shape="768, 3072" offset="21881956" size="9437184" />
			<output>
				<port id="0" precision="FP32" names="158,weight.69">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.vit.encoder.layer.0.output.dense/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_8348" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="31319140" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.vit.encoder.layer.0.output.dense/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="159,input.23">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.vit.encoder.layer.0.output/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="161,input.25">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.vit.encoder.layer.1.layernorm_before/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3076" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.vit.encoder.layer.1.layernorm_before/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_8349" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="31322212" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.vit.encoder.layer.1.layernorm_before/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_8350" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="31325284" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.vit.encoder.layer.1.layernorm_before/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="170,input.27">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_398" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="31328356" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="177,weight.73">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.vit.encoder.layer.1.attention.attention.query/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_8351" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="33687652" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.vit.encoder.layer.1.attention.attention.query/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="178,x.21">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.vit.encoder.layer.1.attention.attention/prim::ListConstruct/Concat" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="33690724" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.vit.encoder.layer.1.attention.attention/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="200,x.23">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_462" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339204" size="16" />
			<output>
				<port id="0" precision="I32" names="201">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.vit.encoder.layer.1.attention.attention/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="202,query_layer.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_404" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="33690740" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="180,weight.75">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.vit.encoder.layer.1.attention.attention.key/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_8352" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="36050036" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.vit.encoder.layer.1.attention.attention.key/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="181,x.13">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.vit.encoder.layer.1.attention.attention/prim::ListConstruct/Concat_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="33690724" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.vit.encoder.layer.1.attention.attention/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="185,x.15">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_422" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="5339204" size="16" />
			<output>
				<port id="0" precision="I32" names="186">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.vit.encoder.layer.1.attention.attention/aten::permute/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="187,key_layer.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.vit.encoder.layer.1.attention.attention/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204,attention_scores.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_8353" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="7701588" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.vit.encoder.layer.1.attention.attention/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="205,input.29">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.vit.encoder.layer.1.attention.attention/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="206,input.31">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>197</dim>
					<dim>197</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_427" type="Const" version="opset1">
			<data element_type="f32" shape="768, 768" offset="36053108" size="2359296" />
			<output>
				<port id="0" precision="FP32" names="189,weight.77">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.vit.encoder.layer.1.attention.attention.value/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>197</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_8354" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="38412404" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.vit.encoder.layer.1.attention.attention.value/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
